*** Validate Cell Implementation

| tag a | tag b | type                  |
|     0 |     0 | 62 bit signed integer |
|     1 |     0 | 7 bytes of UTF-8?     |
|     0 |     1 | cons cell             |
|     1 |     1 | symbol head?          |

The most positive number has a 0 in the most significant position and
1's elsewhere: 01…1112 = 2N−1 − 1. The most negative number has a 1 in
the most significant position and 0's elsewhere: 10…0002 = −2N−1.

#+begin_src python :results output :var cons_examples=cons_examples :var number_examples=number_examples
import bitstring
#print('0'*31 + '1'*31)
#print('0'*62)
#print('1'*62)
#print(bitstring.Bits(bin='0b01111111111111111111111111111111111111111111111111111111111111', length=62).int)
#print(bitstring.Bits(bin='0b10000000000000000000000000000000000000000000000000000000000000', length=62).int)
#print(bitstring.Bits(int=2305843009213693952, length=63).bin)
for head, tail, cell, notes in cons_examples[1:]:
    cell = bitstring.Bits(bin=cell.replace(' ', ''), length=64).hex
    print(f'    assert(mkcons({head}, {tail}) == 0x{cell}); // {notes}')

for vin, vout, cell, notes in number_examples[1:]:
    cell = bitstring.Bits(bin=cell.replace(' ', ''), length=64).hex
    print(f'    assert(mknumber({vin}) == 0x{cell} && "{notes}");')
    print(f'    assert(deref_number_from_cell(mknumber({vin})) == {vout} && "{notes}");')
#+end_src

#+RESULTS:
#+begin_example
    assert(mkcons(0, 0xffff'ffff).val == 0x00000001fffffffd); // Numbers are truncated to 31 bits
    assert(mkcons(0xffff'ffff, 0).val == 0xfffffffe00000001); // Numbers are truncated to 31 bits
    assert(mknumber(0) == 0x0000000000000000 && "Zero");
    assert(deref_number_from_cell(mknumber(0)) == 0 && "Zero");
    assert(mknumber(-1) == 0xfffffffffffffffc && "Negative numbers are represeted properly");
    assert(deref_number_from_cell(mknumber(-1)) == -1 && "Negative numbers are represeted properly");
    assert(mknumber(2305843009213693951) == 0x7ffffffffffffffc && "Most positive number");
    assert(deref_number_from_cell(mknumber(2305843009213693951)) == 2305843009213693951 && "Most positive number");
    assert(mknumber(-2305843009213693952) == 0x8000000000000000 && "Most negative number");
    assert(deref_number_from_cell(mknumber(-2305843009213693952)) == -2305843009213693952 && "Most negative number");
    assert(mknumber(2305843009213693952) == 0x8000000000000000 && "Most positive number + 1 gets truncated");
    assert(deref_number_from_cell(mknumber(2305843009213693952)) == -2305843009213693952 && "Most positive number + 1 gets truncated");
#+end_example

#+name: cons_examples
| Head        | Tail        | Cell                                                                | Notes                            |
| 0           | 0xffff'ffff | 0000000000000000000000000000000 1111111111111111111111111111111 01  | Numbers are truncated to 31 bits |
| 0xffff'ffff | 0           | 1111111111111111111111111111111 0000000000000000000000000000000 01  | Numbers are truncated to 31 bits |

#+name: number_examples
|             Value In |            Value Out | Cell                                                              | Notes                                    |
|                    0 |                    0 | 00000000000000000000000000000000000000000000000000000000000000 00 | Zero                                     |
|                   -1 |                   -1 | 11111111111111111111111111111111111111111111111111111111111111 00 | Negative numbers are represeted properly |
|  2305843009213693951 |  2305843009213693951 | 01111111111111111111111111111111111111111111111111111111111111 00 | Most positive number                     |
| -2305843009213693952 | -2305843009213693952 | 10000000000000000000000000000000000000000000000000000000000000 00 | Most negative number                     |
|  2305843009213693952 | -2305843009213693952 | 10000000000000000000000000000000000000000000000000000000000000 00 | Most positive number + 1 gets truncated  |

#+name: Validate Cell Implementation
#+begin_src c
// TODO: make this invisible to cweave and add table of same info
void validate_cell_implementation(void) @+ {
    assert(iscons(mkcons(0, 0)));
    assert(isnumber(mknumber(0)));
    assert(issymbol(mksymbol('A', 0)));
    ///////////////////
    assert(mkcons(0, 0xffff'ffff).val == 0x00000001fffffffd); // Numbers are truncated to 31 bits
    assert(mkcons(0xffff'ffff, 0).val == 0xfffffffe00000001); // Numbers are truncated to 31 bits
    assert(mknumber(0).val == 0x0000000000000000 && "Zero");
    assert(deref_number_from_cell(mknumber(0)) == 0 && "Zero");
    assert(mknumber(-1).val == 0xfffffffffffffffc && "Negative numbers are represeted properly");
    assert(deref_number_from_cell(mknumber(-1)) == -1 && "Negative numbers are represeted properly");
    assert(mknumber(2305843009213693951).val == 0x7ffffffffffffffc && "Most positive number");
    assert(deref_number_from_cell(mknumber(2305843009213693951)) == 2305843009213693951 && "Most positive number");
    assert(mknumber(-2305843009213693952).val == 0x8000000000000000 && "Most negative number");
    assert(deref_number_from_cell(mknumber(-2305843009213693952)) == -2305843009213693952 && "Most negative number");
    assert(mknumber(2305843009213693952).val == 0x8000000000000000 && "Most positive number + 1 gets truncated");
    assert(deref_number_from_cell(mknumber(2305843009213693952)) == -2305843009213693952 && "Most positive number + 1 gets truncated");
}
#+end_src

